# GROUP BY in SQL (Employees Table)

This notebook demonstrates GROUP BY queries using a simple `employees` table.

In [ ]:

import sqlite3
import pandas as pd

# Create in-memory SQLite DB
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

In [ ]:

cursor.execute("""
CREATE TABLE employees (
   emp_id INT,
   country VARCHAR(30),
   degree VARCHAR(25),
   gender VARCHAR(10),
   department varchar(20),
   salary INT
);
""")

In [ ]:

cursor.executemany("INSERT INTO employees VALUES (?, ?, ?, ?, ?, ?)", [
(1, 'USA', 'MS',  'MALE', 'AI', 170000),
(2, 'USA', 'MBA', 'MALE', 'Business', 140000),
(3, 'USA', 'PHD', 'FEMALE', 'AI', 180000),
(4, 'USA', 'PHD', 'MALE', 'IT', 160000),
(5, 'USA', 'BS', 'FEMALE', None, 120000),
(6, 'CANADA', 'BS',  'MALE', 'Engineering', 170000),
(7, 'CANADA', 'BS', 'MALE', 'Business', 130000),
(8, 'CANADA', 'PHD', 'FEMALE', 'AI', 190000),
(9, 'CANADA', 'MS', 'MALE', 'IT', 150000),
(10, 'INDIA', 'BS',  'FEMALE', 'Engineering', 140000),
(11, 'INDIA', 'MBA', 'FEMALE', 'Business', 160000),
(12, 'INDIA', 'PHD', 'FEMALE', 'AI', 180000),
(13, 'INDIA', 'MS', 'MALE', 'IT', 150000),
(14, 'INDIA', 'PHD', 'FEMALE', 'AI', 150000),
(15, 'INDIA', 'MS', 'MALE', 'IT', 120000)
])
conn.commit()

In [ ]:
pd.read_sql('SELECT * FROM employees', conn)

### Count employees in each country
```sql
SELECT country, COUNT(*) AS num_employees FROM employees GROUP BY country;
```

In [ ]:
pd.read_sql("""SELECT country, COUNT(*) AS num_employees FROM employees GROUP BY country;""", conn)

### Find average salary per country
```sql
SELECT country, AVG(salary) AS avg_salary FROM employees GROUP BY country;
```

In [ ]:
pd.read_sql("""SELECT country, AVG(salary) AS avg_salary FROM employees GROUP BY country;""", conn)

### Find maximum salary per degree
```sql
SELECT degree, MAX(salary) AS max_salary FROM employees GROUP BY degree;
```

In [ ]:
pd.read_sql("""SELECT degree, MAX(salary) AS max_salary FROM employees GROUP BY degree;""", conn)

### Find minimum salary per gender
```sql
SELECT gender, MIN(salary) AS min_salary FROM employees GROUP BY gender;
```

In [ ]:
pd.read_sql("""SELECT gender, MIN(salary) AS min_salary FROM employees GROUP BY gender;""", conn)

### Find total salary per department
```sql
SELECT department, SUM(salary) AS total_salary FROM employees GROUP BY department;
```

In [ ]:
pd.read_sql("""SELECT department, SUM(salary) AS total_salary FROM employees GROUP BY department;""", conn)

### Count employees per country and degree
```sql
SELECT country, degree, COUNT(*) AS num_employees FROM employees GROUP BY country, degree;
```

In [ ]:
pd.read_sql("""SELECT country, degree, COUNT(*) AS num_employees FROM employees GROUP BY country, degree;""", conn)

### Find average salary per country and department
```sql
SELECT country, department, AVG(salary) AS avg_salary FROM employees GROUP BY country, department;
```

In [ ]:
pd.read_sql("""SELECT country, department, AVG(salary) AS avg_salary FROM employees GROUP BY country, department;""", conn)

### Find highest salary per country and gender
```sql
SELECT country, gender, MAX(salary) AS max_salary FROM employees GROUP BY country, gender;
```

In [ ]:
pd.read_sql("""SELECT country, gender, MAX(salary) AS max_salary FROM employees GROUP BY country, gender;""", conn)

### Find countries where average salary is greater than 150000
```sql
SELECT country, AVG(salary) AS avg_salary FROM employees GROUP BY country HAVING AVG(salary) > 150000;
```

In [ ]:
pd.read_sql("""SELECT country, AVG(salary) AS avg_salary FROM employees GROUP BY country HAVING AVG(salary) > 150000;""", conn)

### Find departments with more than 2 employees
```sql
SELECT department, COUNT(*) AS num_employees FROM employees GROUP BY department HAVING COUNT(*) > 2;
```

In [ ]:
pd.read_sql("""SELECT department, COUNT(*) AS num_employees FROM employees GROUP BY department HAVING COUNT(*) > 2;""", conn)

### Find degrees where average salary is above 160000
```sql
SELECT degree, AVG(salary) AS avg_salary FROM employees GROUP BY degree HAVING AVG(salary) > 160000;
```

In [ ]:
pd.read_sql("""SELECT degree, AVG(salary) AS avg_salary FROM employees GROUP BY degree HAVING AVG(salary) > 160000;""", conn)

### Find total salary by country and department (exclude NULL departments)
```sql
SELECT country, department, SUM(salary) AS total_salary FROM employees WHERE department IS NOT NULL GROUP BY country, department;
```

In [ ]:
pd.read_sql("""SELECT country, department, SUM(salary) AS total_salary FROM employees WHERE department IS NOT NULL GROUP BY country, department;""", conn)